[Killed] PublicVisibility
Bank.php:31:5
     /**
      * @throws MissingExchangeRateException
      */
-    public function convert(Money $money, Currency $to) : Money
+    protected function convert(Money $money, Currency $to) : Money
     {
         if($money->getCurrency() == $to) {
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Error: Call to protected method MoneyProblem\Domain\Bank::convert() from scope MoneyProblem\Domain\Portfolio

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:23

ERRORS!
Tests: 1, Assertio

[Killed] Equal
Bank.php:35:9
     {
         if($money->getCurrency() == $to) {
             return $money;
-        } else if($to == $this->pivotCurrency) {
+        if ($to != $this->pivotCurrency) {
             if(!$this->canConvert($money->getCurrency())) {
                 throw new MissingExchangeRateException($money->getCurrency(), $to);
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:34
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\Port

[Killed] AssignmentEqual
Bank.php:35:9
     {
         if($money->getCurrency() == $to) {
             return $money;
-        } else if($to == $this->pivotCurrency) {
+        if ($to = $this->pivotCurrency) {
             if(!$this->canConvert($money->getCurrency())) {
                 throw new MissingExchangeRateException($money->getCurrency(), $to);
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
MoneyProblem\Domain\MissingExchangeRateException: EUR->EUR

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:34
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\Port

[Killed] Equal
Bank.php:41:9
             }
             $amount = $this->convertToPivot($money->getAmount(), $money->getCurrency()); 
             return new Money($amount, $to);
-        } else if($money->getCurrency() == $this->pivotCurrency) {
+        if ($money->getCurrency() != $this->pivotCurrency) {
             if(!$this->canConvert($to)) {
                 throw new MissingExchangeRateException($money->getCurrency(), $to);
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:47
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\Port

[Killed] Division
Bank.php:64:9
      * @return float
      */
     private function convertToPivot(float $amount, Currency $from) : float {
-        $value = $amount / $this->rates[$from->getValue()];
+        $value = $amount * $this->rates[$from->getValue()];
         return ceil($value * 100000) / 100000; // We round to 5 digits after the decimal point
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
Failed asserting that 21504.0 matches expected 19040.00448.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:55

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] IncrementInteger
Bank.php:65:9
      */
     private function convertToPivot(float $amount, Currency $from) : float {
         $value = $amount / $this->rates[$from->getValue()];
-        return ceil($value * 100000) / 100000; // We round to 5 digits after the decimal point
+        return ceil($value * 100001) / 100000;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
Failed asserting that 19040.05824 matches expected 19040.00448.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:55

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] RoundingFamily
Bank.php:65:9
      */
     private function convertToPivot(float $amount, Currency $from) : float {
         $value = $amount / $this->rates[$from->getValue()];
-        return ceil($value * 100000) / 100000; // We round to 5 digits after the decimal point
+        return floor($value * 100000) / 100000;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
Failed asserting that 19039.99105 matches expected 19040.00448.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:55

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] Multiplication
Bank.php:76:9
      * @return float
      */
     private function convertFromPivot(float $amount, Currency $to) : float {
-        $value = $amount * $this->rates[$to->getValue()];
+        $value = $amount / $this->rates[$to->getValue()];
         return ceil($value * 100000) / 100000; // We round to 5 digits after the decimal point
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 13.33334 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Bank.php:77:9
      */
     private function convertFromPivot(float $amount, Currency $to) : float {
         $value = $amount * $this->rates[$to->getValue()];
-        return ceil($value * 100000) / 100000; // We round to 5 digits after the decimal point
+        return ceil($value * 100000) / 100001;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 16.99988000119999 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Bank.php:77:9
      */
     private function convertFromPivot(float $amount, Currency $to) : float {
         $value = $amount * $this->rates[$to->getValue()];
-        return ceil($value * 100000) / 100000; // We round to 5 digits after the decimal point
+        return ceil($value * 100001) / 100000;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 17.000120000000003 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
