[Killed] While_
Portfolio.php:26:9
         $currency = $money->getCurrency()->getValue();
         $find = false;
         $index = 0;
-        while(!$isFinish && !$find && $index < count($this->wallet)){
-            if($this->wallet[$index]->getCurrency()->getValue() == $currency){
-                $find = true;
-                $isFinish = true;
-                $newAmount = $this->wallet[$index]->getAmount() + $money->getAmount();
-                $this->wallet[$index]->setAmount($newAmount);
-            }
-            $index++;
-        }
+        while (false) {
         if(!$find && !$isFinish){
             array_push($this->wallet,$money);
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Failed asserting that 5 matches expected 10.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:40

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Survived] TrueValue
Portfolio.php:29:17
         while(!$isFinish && !$find && $index < count($this->wallet)){
             if($this->wallet[$index]->getCurrency()->getValue() == $currency){
                 $find = true;
-                $isFinish = true;
+                $isFinish = false;
                 $newAmount = $this->wallet[$index]->getAmount() + $money->getAmount();
                 $this->wallet[$index]->setAmount($newAmount);

[Killed] Plus
Portfolio.php:30:17
             if($this->wallet[$index]->getCurrency()->getValue() == $currency){
                 $find = true;
                 $isFinish = true;
-                $newAmount = $this->wallet[$index]->getAmount() + $money->getAmount();
+                $newAmount = $this->wallet[$index]->getAmount() - $money->getAmount();
                 $this->wallet[$index]->setAmount($newAmount);
             }
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Failed asserting that 0 matches expected 10.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:40

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] Foreach_
Portfolio.php:45:9
 
     public function sum(Currency $currency){
         $sum = 0;
-        foreach ($this->wallet as $money) {
-            $sum += $this->bank->convert($money, $currency)->getAmount();
-        }
+        foreach (array() as $money) {
         return $sum;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Assignment
Portfolio.php:46:13
     public function sum(Currency $currency){
         $sum = 0;
         foreach ($this->wallet as $money) {
-            $sum += $this->bank->convert($money, $currency)->getAmount();
+            $sum = $this->bank->convert($money, $currency)->getAmount();
         }
         return $sum;
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 12.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PlusEqual
Portfolio.php:46:13
     public function sum(Currency $currency){
         $sum = 0;
         foreach ($this->wallet as $money) {
-            $sum += $this->bank->convert($money, $currency)->getAmount();
+            $sum -= $this->bank->convert($money, $currency)->getAmount();
         }
         return $sum;
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that -17.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
