[Killed] PublicVisibility
Bank.php:20:5
         $this->rates = $rates;
     }
 
-    public function addRate(Currency $to, float $rate): Bank
+    protected function addRate(Currency $to, float $rate) : Bank
     {
         $this->rates[$to->getValue()] = $rate;
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Error: Call to protected method MoneyProblem\Domain\Bank::addRate() from scope Tests\MoneyProblem\BankBuilder

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\BankBuilder.php:30
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:17

ERRORS!
Tests: 1, Assertions

[Killed] MethodCallRemoval
Bank.php:24:9
     {
         $this->rates[$to->getValue()] = $rate;
         $newBank = new Bank($this->pivotCurrency);
-        $newBank->setRates($this->rates);
+        
         return $newBank;
     }
killedBy: Tests\MoneyProblem\BankTest::test_convert_with_different_exchange_rates
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_with_different_exchange_rates
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:40
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:83

ERRORS!
Tests: 11, Assertions: 16, Errors: 1.

[Killed] PublicVisibility
Bank.php:31:5
     /**
      * @throws MissingExchangeRateException
      */
-    public function convert(Money $money, Currency $to): float
+    protected function convert(Money $money, Currency $to) : float
     {
         if($money->getCurrency() == $to) {
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Error: Call to protected method MoneyProblem\Domain\Bank::convert() from scope MoneyProblem\Domain\Portfolio

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:23

ERRORS!
Tests: 1, Assertio

[Killed] Equal
Bank.php:33:9
      */
     public function convert(Money $money, Currency $to): float
     {
-        if($money->getCurrency() == $to) {
+        if ($money->getCurrency() != $to) {
             return $money->getAmount();
         } else if($to == $this->pivotCurrency) {
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 15.00001 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Equal
Bank.php:35:9
     {
         if($money->getCurrency() == $to) {
             return $money->getAmount();
-        } else if($to == $this->pivotCurrency) {
+        if ($to != $this->pivotCurrency) {
             if(!$this->canConvert($money->getCurrency())) {
                 throw new MissingExchangeRateException($money->getCurrency(), $to);
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:34
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\Port

[Killed] AssignmentEqual
Bank.php:35:9
     {
         if($money->getCurrency() == $to) {
             return $money->getAmount();
-        } else if($to == $this->pivotCurrency) {
+        if ($to = $this->pivotCurrency) {
             if(!$this->canConvert($money->getCurrency())) {
                 throw new MissingExchangeRateException($money->getCurrency(), $to);
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
MoneyProblem\Domain\MissingExchangeRateException: EUR->EUR

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:34
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\Port

[Killed] LogicalNot
Bank.php:36:13
         if($money->getCurrency() == $to) {
             return $money->getAmount();
         } else if($to == $this->pivotCurrency) {
-            if(!$this->canConvert($money->getCurrency())) {
+            if ($this->canConvert($money->getCurrency())) {
                 throw new MissingExchangeRateException($money->getCurrency(), $to);
             }
killedBy: Tests\MoneyProblem\BankTest::test_convert_different_currency_and_go_back
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_different_currency_and_go_back
MoneyProblem\Domain\MissingExchangeRateException: USD->EUR

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:34
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:38

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.

[NoCoverage] Throw_
Bank.php:37:17
             return $money->getAmount();
         } else if($to == $this->pivotCurrency) {
             if(!$this->canConvert($money->getCurrency())) {
-                throw new MissingExchangeRateException($money->getCurrency(), $to);
+                new MissingExchangeRateException($money->getCurrency(), $to);
             }
             return $this->convertToPivot($money->getAmount(), $money->getCurrency());

[Killed] Equal
Bank.php:40:9
                 throw new MissingExchangeRateException($money->getCurrency(), $to);
             }
             return $this->convertToPivot($money->getAmount(), $money->getCurrency());
-        } else if($money->getCurrency() == $this->pivotCurrency) {
+        if ($money->getCurrency() != $this->pivotCurrency) {
             if(!$this->canConvert($to)) {
                 throw new MissingExchangeRateException($money->getCurrency(), $to);
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:45
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\Port

[Killed] LogicalNot
Bank.php:41:13
             }
             return $this->convertToPivot($money->getAmount(), $money->getCurrency());
         } else if($money->getCurrency() == $this->pivotCurrency) {
-            if(!$this->canConvert($to)) {
+            if ($this->canConvert($to)) {
                 throw new MissingExchangeRateException($money->getCurrency(), $to);
             }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:40
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\Port

[Killed] Throw_
Bank.php:42:17
             return $this->convertToPivot($money->getAmount(), $money->getCurrency());
         } else if($money->getCurrency() == $this->pivotCurrency) {
             if(!$this->canConvert($to)) {
-                throw new MissingExchangeRateException($money->getCurrency(), $to);
+                new MissingExchangeRateException($money->getCurrency(), $to);
             }
             return $this->convertFromPivot($money->getAmount(), $to);
killedBy: Tests\MoneyProblem\BankTest::test_convert_throws_exception_when_rate_is_unknow
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_throws_exception_when_rate_is_unknow
Undefined array key "KRW"

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:60
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:42
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\BankTest.php:75

[Killed] LogicalNot
Bank.php:46:13
             }
             return $this->convertFromPivot($money->getAmount(), $to);
         } else {
-            if(!$this->canConvert($money->getCurrency()) || !$this->canConvert($to) ) {
+            if (!$this->canConvert($money->getCurrency()) || $this->canConvert($to)) {
                 throw new MissingExchangeRateException($money->getCurrency(), $to);
             }
killedBy: Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
MoneyProblem\Domain\MissingExchangeRateException: USD->KRW

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:45
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\

[Killed] LogicalNot
Bank.php:46:13
             }
             return $this->convertFromPivot($money->getAmount(), $to);
         } else {
-            if(!$this->canConvert($money->getCurrency()) || !$this->canConvert($to) ) {
+            if ($this->canConvert($money->getCurrency()) || !$this->canConvert($to)) {
                 throw new MissingExchangeRateException($money->getCurrency(), $to);
             }
killedBy: Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
MoneyProblem\Domain\MissingExchangeRateException: USD->KRW

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:45
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\

[NoCoverage] Throw_
Bank.php:47:17
             return $this->convertFromPivot($money->getAmount(), $to);
         } else {
             if(!$this->canConvert($money->getCurrency()) || !$this->canConvert($to) ) {
-                throw new MissingExchangeRateException($money->getCurrency(), $to);
+                new MissingExchangeRateException($money->getCurrency(), $to);
             }
             return $this->convertWithPivot($money, $to);

[Killed] Division
Bank.php:54:9
     }
 
     private function convertToPivot(float $amount, Currency $from) {
-        $value = $amount / $this->rates[$from->getValue()];
+        $value = $amount * $this->rates[$from->getValue()];
         return ceil($value * 100000) / 100000; // On arrondi a 5 chiffres après la virgule
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
Failed asserting that 21504.0 matches expected 19040.00448.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:55

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] RoundingFamily
Bank.php:55:9
 
     private function convertToPivot(float $amount, Currency $from) {
         $value = $amount / $this->rates[$from->getValue()];
-        return ceil($value * 100000) / 100000; // On arrondi a 5 chiffres après la virgule
+        return floor($value * 100000) / 100000;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
Failed asserting that 19039.99105 matches expected 19040.00448.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:55

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] IncrementInteger
Bank.php:55:9
 
     private function convertToPivot(float $amount, Currency $from) {
         $value = $amount / $this->rates[$from->getValue()];
-        return ceil($value * 100000) / 100000; // On arrondi a 5 chiffres après la virgule
+        return ceil($value * 100001) / 100000;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_convert_potfolio
Failed asserting that 19040.05824 matches expected 19040.00448.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:55

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] Multiplication
Bank.php:59:9
     }
 
     private function convertFromPivot(float $amount, Currency $to) {
-        $value = $amount * $this->rates[$to->getValue()];
+        $value = $amount / $this->rates[$to->getValue()];
         return ceil($value * 100000) / 100000;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 13.33334 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Division
Bank.php:60:9
 
     private function convertFromPivot(float $amount, Currency $to) {
         $value = $amount * $this->rates[$to->getValue()];
-        return ceil($value * 100000) / 100000;
+        return ceil($value * 100000) * 100000;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 120000000005.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Bank.php:60:9
 
     private function convertFromPivot(float $amount, Currency $to) {
         $value = $amount * $this->rates[$to->getValue()];
-        return ceil($value * 100000) / 100000;
+        return ceil($value * 100001) / 100000;
     }
 
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 17.000120000000003 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FunctionCall
Bank.php:71:9
 
     private function canConvert(Currency $to)
     {
-        return array_key_exists($to->getValue(), $this->rates);
+        array_key_exists($to->getValue(), $this->rates);
+        return null;
     }
 }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:40
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\Port
