[Killed] MethodCallRemoval
MissingExchangeRateException.php:9:9
 {
     public function __construct(Currency $from, Currency $to)
     {
-        parent::__construct(sprintf('%s->%s', $from, $to));
+        
     }
 }
killedBy: Tests\MoneyProblem\BankTest::test_convert_throws_exception_when_rate_is_unknow
statusReason: 1) Tests\MoneyProblem\BankTest::test_convert_throws_exception_when_rate_is_unknow
Failed asserting that exception message '' contains 'EUR->KRW'.

FAILURES!
Tests: 5, Assertions: 10, Failures: 1.
