[Killed] PublicVisibility
Money.php:15:5
         $this->currency = $currency;
     }
 
-    public function times($times){
+    protected function times($times)
         $temp = $this->amount * $times;
         $this->setAmount($temp);
killedBy: Tests\MoneyProblem\MoneyTest::test_addMoney
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_addMoney
Error: Call to protected method MoneyProblem\Domain\Money::times() from scope Tests\MoneyProblem\MoneyTest

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:35

ERRORS!
Tests: 4, Assertions: 5, Errors: 1.

[Killed] Multiplication
Money.php:16:9
     }
 
     public function times($times){
-        $temp = $this->amount * $times;
+        $temp = $this->amount / $times;
         $this->setAmount($temp);
         return $temp;
killedBy: Tests\MoneyProblem\MoneyTest::test_addMoney
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_addMoney
Failed asserting that 20 matches expected 5.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:37

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Survived] MethodCallRemoval
Money.php:17:9
 
     public function times($times){
         $temp = $this->amount * $times;
-        $this->setAmount($temp);
+        
         return $temp;
     }

[Killed] PublicVisibility
Money.php:21:5
         return $temp;
     }
     
-    public function getAmount(){
+    protected function getAmount()
         return $this->amount;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Error: Call to protected method MoneyProblem\Domain\Money::getAmount() from scope MoneyProblem\Domain\Bank

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Bank.php:34
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:46
C:\Users\simon\Documents\Artisanat\

[Killed] PublicVisibility
Money.php:24:5
     public function getAmount(){
         return $this->amount;
     }
-    public function setAmount($amount){
+    protected function setAmount($amount)
         $this->amount=$amount;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Error: Call to protected method MoneyProblem\Domain\Money::setAmount() from scope MoneyProblem\Domain\Portfolio

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:31
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:36

ERRORS!
Tests: 2, Asser

[Killed] PublicVisibility
Money.php:28:5
         $this->amount=$amount;
     }
 
-    public function getCurrency():Currency{
+    protected function getCurrency() : Currency
         return $this->currency;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Error: Call to protected method MoneyProblem\Domain\Money::getCurrency() from scope MoneyProblem\Domain\Portfolio

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:23
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:21

ERRORS!
Tests: 1, Ass
