[Killed] PublicVisibility
MoneyCalculator.php:7:5
 
 class MoneyCalculator
 {
-    public static function add(float $firstAmount, Currency $currency, float $secondAmount): float
+    protected static function add(float $firstAmount, Currency $currency, float $secondAmount) : float
     {
         return $firstAmount + $secondAmount;
killedBy: Tests\MoneyProblem\MoneyTest::test_add
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_add
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::add() from scope Tests\MoneyProblem\MoneyTest

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:14

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] Plus
MoneyCalculator.php:9:9
 {
     public static function add(float $firstAmount, Currency $currency, float $secondAmount): float
     {
-        return $firstAmount + $secondAmount;
+        return $firstAmount - $secondAmount;
     }
 

[Killed] PublicVisibility
MoneyCalculator.php:12:5
         return $firstAmount + $secondAmount;
     }
 
-    public static function times(float $firstAmount, Currency $currency, int $value): float
+    protected static function times(float $firstAmount, Currency $currency, int $value) : float
     {
         return $firstAmount * $value;
killedBy: Tests\MoneyProblem\MoneyTest::test_multiply
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_multiply
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::times() from scope Tests\MoneyProblem\MoneyTest

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:21

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.

[Killed] Multiplication
MoneyCalculator.php:14:9
 
     public static function times(float $firstAmount, Currency $currency, int $value): float
     {
-        return $firstAmount * $value;
+        return $firstAmount / $value;
     }
 
killedBy: Tests\MoneyProblem\MoneyTest::test_multiply
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_multiply
Failed asserting that 10 is less than 5.0.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:22

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
MoneyCalculator.php:17:5
         return $firstAmount * $value;
     }
 
-    public static function divide(float $firstAmount, Currency $currency, int $value): float
+    protected static function divide(float $firstAmount, Currency $currency, int $value) : float
     {
         return $firstAmount / $value;
killedBy: Tests\MoneyProblem\MoneyTest::test_divide
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::divide() from scope Tests\MoneyProblem\MoneyTest

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:27

ERRORS!
Tests: 3, Assertions: 3, Errors: 1.

[Killed] Division
MoneyCalculator.php:19:9
 
     public static function divide(float $firstAmount, Currency $currency, int $value): float
     {
-        return $firstAmount / $value;
+        return $firstAmount * $value;
     }
 }
killedBy: Tests\MoneyProblem\MoneyTest::test_divide
statusReason: 1) Tests\MoneyProblem\MoneyTest::test_divide
Failed asserting that 1000.5 matches expected 16008.0.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\MoneyTest.php:28

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.
