[Killed] PublicVisibility
Portfolio.php:16:5
         $this->wallet = [];
     }
 
-    public function addMoney(Money $money){
+    protected function addMoney(Money $money)
         $newPortfolio = new Portfolio($this->getBank());
         $isFinish = false;
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Error: Call to protected method MoneyProblem\Domain\Portfolio::addMoney() from scope Tests\MoneyProblem\PortfolioTest

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:21

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] FalseValue
Portfolio.php:18:9
 
     public function addMoney(Money $money){
         $newPortfolio = new Portfolio($this->getBank());
-        $isFinish = false;
+        $isFinish = true;
         if(empty($this->wallet)){
             array_push($this->wallet,$money);
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 5.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FunctionCallRemoval
Portfolio.php:20:13
         $newPortfolio = new Portfolio($this->getBank());
         $isFinish = false;
         if(empty($this->wallet)){
-            array_push($this->wallet,$money);
+            
             $isFinish = true;
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] TrueValue
Portfolio.php:21:13
         $isFinish = false;
         if(empty($this->wallet)){
             array_push($this->wallet,$money);
-            $isFinish = true;
+            $isFinish = false;
         }
         $currency = $money->getCurrency()->getValue();
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 22.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FalseValue
Portfolio.php:24:9
             $isFinish = true;
         }
         $currency = $money->getCurrency()->getValue();
-        $find = false;
+        $find = true;
         $index = 0;
         while(!$isFinish && !$find && $index < count($this->wallet)){
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 5.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Portfolio.php:25:9
         }
         $currency = $money->getCurrency()->getValue();
         $find = false;
-        $index = 0;
+        $index = -1;
         while(!$isFinish && !$find && $index < count($this->wallet)){
             if($this->wallet[$index]->getCurrency()->getValue() == $currency){
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Undefined array key -1

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:26
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:22

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalNot
Portfolio.php:26:9
         $currency = $money->getCurrency()->getValue();
         $find = false;
         $index = 0;
-        while(!$isFinish && !$find && $index < count($this->wallet)){
+        while (!$isFinish && $find && $index < count($this->wallet)) {
             if($this->wallet[$index]->getCurrency()->getValue() == $currency){
                 $find = !$find;
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Failed asserting that 5 matches expected 10.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:40

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] While_
Portfolio.php:26:9
         $currency = $money->getCurrency()->getValue();
         $find = false;
         $index = 0;
-        while(!$isFinish && !$find && $index < count($this->wallet)){
-            if($this->wallet[$index]->getCurrency()->getValue() == $currency){
-                $find = !$find;
-                $isFinish = !$isFinish;
-                $newAmount = $this->wallet[$index]->getAmount() + $money->getAmount();
-                $this->wallet[$index]->setAmount($newAmount);
-            }
-            $index++;
-        }
+        while (false) {
         if(!$find && !$isFinish){
             array_push($this->wallet,$money);
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Failed asserting that 5 matches expected 10.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:40

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] Equal
Portfolio.php:27:13
         $find = false;
         $index = 0;
         while(!$isFinish && !$find && $index < count($this->wallet)){
-            if($this->wallet[$index]->getCurrency()->getValue() == $currency){
+            if ($this->wallet[$index]->getCurrency()->getValue() != $currency) {
                 $find = !$find;
                 $isFinish = !$isFinish;
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 15.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] LogicalNot
Portfolio.php:28:17
         $index = 0;
         while(!$isFinish && !$find && $index < count($this->wallet)){
             if($this->wallet[$index]->getCurrency()->getValue() == $currency){
-                $find = !$find;
+                $find = $find;
                 $isFinish = !$isFinish;
                 $newAmount = $this->wallet[$index]->getAmount() + $money->getAmount();

[Survived] LogicalNot
Portfolio.php:29:17
         while(!$isFinish && !$find && $index < count($this->wallet)){
             if($this->wallet[$index]->getCurrency()->getValue() == $currency){
                 $find = !$find;
-                $isFinish = !$isFinish;
+                $isFinish = $isFinish;
                 $newAmount = $this->wallet[$index]->getAmount() + $money->getAmount();
                 $this->wallet[$index]->setAmount($newAmount);

[Killed] Plus
Portfolio.php:30:17
             if($this->wallet[$index]->getCurrency()->getValue() == $currency){
                 $find = !$find;
                 $isFinish = !$isFinish;
-                $newAmount = $this->wallet[$index]->getAmount() + $money->getAmount();
+                $newAmount = $this->wallet[$index]->getAmount() - $money->getAmount();
                 $this->wallet[$index]->setAmount($newAmount);
             }
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Failed asserting that 0 matches expected 10.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:40

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Portfolio.php:31:17
                 $find = !$find;
                 $isFinish = !$isFinish;
                 $newAmount = $this->wallet[$index]->getAmount() + $money->getAmount();
-                $this->wallet[$index]->setAmount($newAmount);
+                
             }
             $index++;
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Failed asserting that 5 matches expected 10.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:40

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] Increment
Portfolio.php:33:13
                 $newAmount = $this->wallet[$index]->getAmount() + $money->getAmount();
                 $this->wallet[$index]->setAmount($newAmount);
             }
-            $index++;
+            $index--;
         }
         if(!$find && !$isFinish){
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Undefined array key -1

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\src\MoneyProblem\Domain\Portfolio.php:26
C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:22

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalNot
Portfolio.php:35:9
             }
             $index++;
         }
-        if(!$find && !$isFinish){
+        if ($find && !$isFinish) {
             array_push($this->wallet,$money);
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 5.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Portfolio.php:35:9
             }
             $index++;
         }
-        if(!$find && !$isFinish){
+        if (!$find && $isFinish) {
             array_push($this->wallet,$money);
         }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 10.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FunctionCallRemoval
Portfolio.php:36:13
             $index++;
         }
         if(!$find && !$isFinish){
-            array_push($this->wallet,$money);
+            
         }
         
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 5.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Portfolio.php:39:9
             array_push($this->wallet,$money);
         }
         
-        $newPortfolio->setWallet($this->getWallet());
+        
         return $newPortfolio;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Portfolio.php:43:5
         return $newPortfolio;
     }
 
-    public function sum(Currency $currency){
+    protected function sum(Currency $currency)
         $sum = 0;
         foreach ($this->wallet as $money) {
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Error: Call to protected method MoneyProblem\Domain\Portfolio::sum() from scope Tests\MoneyProblem\PortfolioTest

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:23

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] DecrementInteger
Portfolio.php:44:9
     }
 
     public function sum(Currency $currency){
-        $sum = 0;
+        $sum = -1;
         foreach ($this->wallet as $money) {
             $sum += $this->bank->convert($money, $currency);
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 16.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Foreach_
Portfolio.php:45:9
 
     public function sum(Currency $currency){
         $sum = 0;
-        foreach ($this->wallet as $money) {
-            $sum += $this->bank->convert($money, $currency);
-        }
+        foreach (array() as $money) {
         return $sum;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Assignment
Portfolio.php:46:13
     public function sum(Currency $currency){
         $sum = 0;
         foreach ($this->wallet as $money) {
-            $sum += $this->bank->convert($money, $currency);
+            $sum = $this->bank->convert($money, $currency);
         }
         return $sum;
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that 12.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PlusEqual
Portfolio.php:46:13
     public function sum(Currency $currency){
         $sum = 0;
         foreach ($this->wallet as $money) {
-            $sum += $this->bank->convert($money, $currency);
+            $sum -= $this->bank->convert($money, $currency);
         }
         return $sum;
killedBy: Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_sum_potfolio
Failed asserting that -17.0 matches expected 17.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:24

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Portfolio.php:51:5
         return $sum;
     }
 
-    public function getAmountByCurrency(Currency $currency){
+    protected function getAmountByCurrency(Currency $currency)
         $find = false;
         $index = 0;
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Error: Call to protected method MoneyProblem\Domain\Portfolio::getAmountByCurrency() from scope Tests\MoneyProblem\PortfolioTest

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:37

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] FalseValue
Portfolio.php:52:9
     }
 
     public function getAmountByCurrency(Currency $currency){
-        $find = false;
+        $find = true;
         $index = 0;
         $amount = 0;
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Failed asserting that 0 matches expected 10.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:40

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] DecrementInteger
Portfolio.php:54:9
     public function getAmountByCurrency(Currency $currency){
         $find = false;
         $index = 0;
-        $amount = 0;
+        $amount = -1;
         while(!$find && $index < count($this->wallet)){
             if($this->wallet[$index]->getCurrency()->getValue() == $currency){
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Failed asserting that -1 matches expected 0.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:39

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] LessThanNegotiation
Portfolio.php:55:9
         $find = false;
         $index = 0;
         $amount = 0;
-        while(!$find && $index < count($this->wallet)){
+        while (!$find && $index >= count($this->wallet)) {
             if($this->wallet[$index]->getCurrency()->getValue() == $currency){
                 $find = true;
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Failed asserting that 0 matches expected 10.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:40

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] While_
Portfolio.php:55:9
         $find = false;
         $index = 0;
         $amount = 0;
-        while(!$find && $index < count($this->wallet)){
-            if($this->wallet[$index]->getCurrency()->getValue() == $currency){
-                $find = true;
-                $amount = $this->wallet[$index]->getAmount();
-            }
-            $index++;
-        }
+        while (false) {
         return $amount;
     }
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Failed asserting that 0 matches expected 10.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:40

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] Equal
Portfolio.php:56:13
         $index = 0;
         $amount = 0;
         while(!$find && $index < count($this->wallet)){
-            if($this->wallet[$index]->getCurrency()->getValue() == $currency){
+            if ($this->wallet[$index]->getCurrency()->getValue() != $currency) {
                 $find = true;
                 $amount = $this->wallet[$index]->getAmount();
killedBy: Tests\MoneyProblem\PortfolioTest::test_add_potfolio
statusReason: 1) Tests\MoneyProblem\PortfolioTest::test_add_potfolio
Failed asserting that 10 matches expected 0.

C:\Users\simon\Documents\Artisanat\xtrem-craft-workshop\php\tests\MoneyProblem\PortfolioTest.php:39

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Survived] TrueValue
Portfolio.php:57:17
         $amount = 0;
         while(!$find && $index < count($this->wallet)){
             if($this->wallet[$index]->getCurrency()->getValue() == $currency){
-                $find = true;
+                $find = false;
                 $amount = $this->wallet[$index]->getAmount();
             }
