[Killed] PublicVisibility
Bank.php:26:5
      * @param float $rate
      * @return Bank
      */
-    public static function create(Currency $currency1, Currency $currency2, float $rate) : Bank
+    protected static function create(Currency $currency1, Currency $currency2, float $rate) : Bank
     {
         $bank = new Bank([]);
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
Error: Call to protected method MoneyProblem\Domain\Bank::create() from scope Tests\MoneyProblem\Domain\BankTest

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:16

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Bank.php:40:5
      * @param float $rate
      * @return void
      */
-    public function addEchangeRate(Currency $fromDevise, Currency $toDevise, float $rate): void
+    protected function addEchangeRate(Currency $fromDevise, Currency $toDevise, float $rate) : void
     {
         $this->exchangeRates[($this->getKey($fromDevise, $toDevise))] = $rate;
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_with_different_exchange_rates_returns_different_floats
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_with_different_exchange_rates_returns_different_floats
Error: Call to protected method MoneyProblem\Domain\Bank::addEchangeRate() from scope Tests\MoneyProblem\Domain\BankTest

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:57

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] PublicVisibility
Bank.php:52:5
      * @return float
      * @throws MissingExchangeRateException
      */
-    public function convert(float $amount, Currency $fromDevise, Currency $toDevise): float
+    protected function convert(float $amount, Currency $fromDevise, Currency $toDevise) : float
     {
         if ($this->isConvertNonValid($fromDevise, $toDevise)) {
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
Error: Call to protected method MoneyProblem\Domain\Bank::convert() from scope Tests\MoneyProblem\Domain\BankTest

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
Bank.php:55:13
     public function convert(float $amount, Currency $fromDevise, Currency $toDevise): float
     {
         if ($this->isConvertNonValid($fromDevise, $toDevise)) {
-            throw new MissingExchangeRateException($fromDevise, $toDevise);
+            new MissingExchangeRateException($fromDevise, $toDevise);
         }
         return $fromDevise == $toDevise
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_throws_exception_on_missing_exchange_rate
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_throws_exception_on_missing_exchange_rate
Undefined array key "EUR->KRW"

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:51
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:42

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] AssignmentEqual
Bank.php:57:9
         if ($this->isConvertNonValid($fromDevise, $toDevise)) {
             throw new MissingExchangeRateException($fromDevise, $toDevise);
         }
-        return $fromDevise == $toDevise
+        return ($fromDevise = $toDevise) ? $amount : $amount * $this->exchangeRates[$this->getKey($fromDevise, $toDevise)];
             ? $amount
             : $amount * $this->exchangeRates[($this->getKey($fromDevise, $toDevise))];
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
Failed asserting that 10.0 matches expected 12.

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:22

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Equal
Bank.php:57:9
         if ($this->isConvertNonValid($fromDevise, $toDevise)) {
             throw new MissingExchangeRateException($fromDevise, $toDevise);
         }
-        return $fromDevise == $toDevise
+        return $fromDevise != $toDevise ? $amount : $amount * $this->exchangeRates[$this->getKey($fromDevise, $toDevise)];
             ? $amount
             : $amount * $this->exchangeRates[($this->getKey($fromDevise, $toDevise))];
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
Failed asserting that 10.0 matches expected 12.

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:22

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Multiplication
Bank.php:59:13
         }
         return $fromDevise == $toDevise
             ? $amount
-            : $amount * $this->exchangeRates[($this->getKey($fromDevise, $toDevise))];
+            return $fromDevise == $toDevise ? $amount : $amount / $this->exchangeRates[$this->getKey($fromDevise, $toDevise)];
     }
 
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
Failed asserting that 8.333333333333334 matches expected 12.

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:22

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Bank.php:64:9
 
     private function isConvertNonValid(Currency $fromDevise, Currency $toDevise): bool
     {
-        return ($fromDevise != $toDevise && !array_key_exists($this->getKey($fromDevise, $toDevise), $this->exchangeRates));
+        return $fromDevise != $toDevise && array_key_exists($this->getKey($fromDevise, $toDevise), $this->exchangeRates);
     }
 
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:49
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:19

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] NotEqual
Bank.php:64:9
 
     private function isConvertNonValid(Currency $fromDevise, Currency $toDevise): bool
     {
-        return ($fromDevise != $toDevise && !array_key_exists($this->getKey($fromDevise, $toDevise), $this->exchangeRates));
+        return $fromDevise == $toDevise && !array_key_exists($this->getKey($fromDevise, $toDevise), $this->exchangeRates);
     }
 
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_eur_returns_same_value
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_eur_returns_same_value
MoneyProblem\Domain\MissingExchangeRateException: EUR->EUR

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:49
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:31

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] ConcatOperandRemoval
Bank.php:68:9
     }
 
     private function getKey(Currency $fromDevise, Currency $toDevise) : string {
-        return $fromDevise . '->' . $toDevise;
+        return $fromDevise . '->';
     }
 }
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_throws_exception_on_missing_exchange_rate
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_throws_exception_on_missing_exchange_rate
Failed asserting that exception of type "MoneyProblem\Domain\MissingExchangeRateException" is thrown.

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Survived] ConcatOperandRemoval
Bank.php:68:9
     }
 
     private function getKey(Currency $fromDevise, Currency $toDevise) : string {
-        return $fromDevise . '->' . $toDevise;
+        return '->' . $toDevise;
     }
 }
