[Killed] PublicVisibility
MoneyCalculator.php:7:5
 
 class MoneyCalculator
 {
-    public static function add(float $amount1, float $amount2): float
+    protected static function add(float $amount1, float $amount2) : float
     {
         return $amount1 + $amount2;
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_add_returns_value
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_add_returns_value
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::add() from scope Tests\MoneyProblem\Domain\MoneyTest

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:14

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Plus
MoneyCalculator.php:9:9
 {
     public static function add(float $amount1, float $amount2): float
     {
-        return $amount1 + $amount2;
+        return $amount1 - $amount2;
     }
 
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_add_returns_value
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_add_returns_value
Failed asserting that 10 matches expected 0.0.

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:20

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
MoneyCalculator.php:12:5
         return $amount1 + $amount2;
     }
 
-    public static function times(float $amount, float $value): float
+    protected static function times(float $amount, float $value) : float
     {
         return $amount * $value;
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_multiply_returns_positive_number
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_multiply_returns_positive_number
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::times() from scope Tests\MoneyProblem\Domain\MoneyTest

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:26

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
MoneyCalculator.php:17:5
         return $amount * $value;
     }
 
-    public static function divide(float $amount, float $value): float
+    protected static function divide(float $amount, float $value) : float
     {
         return $amount / $value;
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_divide_won_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_divide_won_returns_float
Error: Call to protected method MoneyProblem\Domain\MoneyCalculator::divide() from scope Tests\MoneyProblem\Domain\MoneyTest

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:38

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
