[NoCoverage] PublicVisibility
Bank.php:52:5
      * @return float
      * @throws MissingExchangeRateException
      */
-    public function convertOld(float $amount, Currency $fromDevise, Currency $toDevise): float
+    protected function convertOld(float $amount, Currency $fromDevise, Currency $toDevise) : float
     {
         $money = new Money($amount, $fromDevise);

[Killed] LogicalAnd
Bank.php:60:9
 
     private function isConvertNonValid(Currency $fromDevise, Currency $toDevise): bool
     {
-        return ($fromDevise != $toDevise && !array_key_exists($this->getKey($fromDevise, $toDevise), $this->exchangeRates));
+        return $fromDevise != $toDevise || !array_key_exists($this->getKey($fromDevise, $toDevise), $this->exchangeRates);
     }
 
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
MoneyProblem\Domain\MissingExchangeRateException: EUR->USD

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:69
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:23

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Bank.php:74:5
      * @return float
      * @throws MissingExchangeRateException
      */
-    public function convert(Money $money, Currency $toDevise): Money
+    protected function convert(Money $money, Currency $toDevise) : Money
     {
         if ($this->isConvertNonValid($money->getCurrency(), $toDevise)) {
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
Error: Call to protected method MoneyProblem\Domain\Bank::convert() from scope Tests\MoneyProblem\Domain\BankTest

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:23

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
Bank.php:77:13
     public function convert(Money $money, Currency $toDevise): Money
     {
         if ($this->isConvertNonValid($money->getCurrency(), $toDevise)) {
-            throw new MissingExchangeRateException($money->getCurrency(), $toDevise);
+            new MissingExchangeRateException($money->getCurrency(), $toDevise);
         }
         return $money->getCurrency() == $toDevise
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_throws_exception_on_missing_exchange_rate
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_throws_exception_on_missing_exchange_rate
Undefined array key "EUR->KRW"

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:71
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:46

ERRORS!
Tests: 3, Assertions: 2, Errors: 1.

[Killed] Equal
Bank.php:79:9
         if ($this->isConvertNonValid($money->getCurrency(), $toDevise)) {
             throw new MissingExchangeRateException($money->getCurrency(), $toDevise);
         }
-        return $money->getCurrency() == $toDevise
+        return $money->getCurrency() != $toDevise ? $money : new Money($money->getMoney() * $this->exchangeRates[$this->getKey($money->getCurrency(), $toDevise)], $toDevise);
             ? $money
             : new Money($money->getMoney() * $this->exchangeRates[($this->getKey($money->getCurrency(), $toDevise))], $toDevise);
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
-    'money' => 12.0
+    'money' => 10.0

[Killed] Multiplication
Bank.php:81:13
         }
         return $money->getCurrency() == $toDevise
             ? $money
-            : new Money($money->getMoney() * $this->exchangeRates[($this->getKey($money->getCurrency(), $toDevise))], $toDevise);
+            return $money->getCurrency() == $toDevise ? $money : new Money($money->getMoney() / $this->exchangeRates[$this->getKey($money->getCurrency(), $toDevise)], $toDevise);
     }
 }
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
-    'money' => 12.0
+    'money' => 8.333333333333334
