[Killed] LessThan
Money.php:20:9
      */
     public function __construct(float $money, Currency $currency)
     {
-        if ($money < 0) {
+        if ($money <= 0) {
             throw new \InvalidArgumentException();
         }
killedBy: Tests\MoneyProblem\Domain\PortfolioTest::test_evaluate_in_usd
statusReason: 1) Tests\MoneyProblem\Domain\PortfolioTest::test_evaluate_in_usd
InvalidArgumentException: 

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:19
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:25
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/Domain/PortfolioTe

[Killed] LessThanNegotiation
Money.php:20:9
      */
     public function __construct(float $money, Currency $currency)
     {
-        if ($money < 0) {
+        if ($money >= 0) {
             throw new \InvalidArgumentException();
         }
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
InvalidArgumentException: 

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:19
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:23

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[NoCoverage] Throw_
Money.php:21:13
     public function __construct(float $money, Currency $currency)
     {
         if ($money < 0) {
-            throw new \InvalidArgumentException();
+            new \InvalidArgumentException();
         }
         $this->money = $money;

[Killed] PublicVisibility
Money.php:30:5
     /**
      * @return float
      */
-    public function getMoney(): float
+    protected function getMoney() : float
     {
         return $this->money;
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
Error: Call to protected method MoneyProblem\Domain\Money::getMoney() from scope MoneyProblem\Domain\Bank

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:81
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:23

ERRORS!
Tests: 1

[NoCoverage] PublicVisibility
Money.php:38:5
     /**
      * @param float $money
      */
-    public function setMoney(float $money): void
+    protected function setMoney(float $money) : void
     {
         $this->money = $money;

[Killed] PublicVisibility
Money.php:46:5
     /**
      * @return \MoneyProblem\Domain\Currency
      */
-    public function getCurrency(): \MoneyProblem\Domain\Currency
+    protected function getCurrency() : \MoneyProblem\Domain\Currency
     {
         return $this->currency;
killedBy: Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
statusReason: 1) Tests\MoneyProblem\Domain\BankTest::test_convert_eur_to_usd_returns_float
Error: Call to protected method MoneyProblem\Domain\Money::getCurrency() from scope MoneyProblem\Domain\Bank

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Bank.php:76
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/BankTest.php:23

ERRORS!
Tests

[NoCoverage] PublicVisibility
Money.php:54:5
     /**
      * @param \MoneyProblem\Domain\Currency $currency
      */
-    public function setCurrency(\MoneyProblem\Domain\Currency $currency): void
+    protected function setCurrency(\MoneyProblem\Domain\Currency $currency) : void
     {
         $this->currency = $currency;

[Killed] PublicVisibility
Money.php:62:5
 
 
 
-    public function times(float $timesAmount): Money
+    protected function times(float $timesAmount) : Money
     {
         if ($timesAmount < 0) {
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_multiply_euro_by_2
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_multiply_euro_by_2
Error: Call to protected method MoneyProblem\Domain\Money::times() from scope Tests\MoneyProblem\Domain\MoneyTest

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:56

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LessThanNegotiation
Money.php:64:9
 
     public function times(float $timesAmount): Money
     {
-        if ($timesAmount < 0) {
+        if ($timesAmount >= 0) {
             throw new \InvalidArgumentException();
         }
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_multiply_euro_by_2
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_multiply_euro_by_2
InvalidArgumentException: 

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:55
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:56

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] LessThan
Money.php:64:9
 
     public function times(float $timesAmount): Money
     {
-        if ($timesAmount < 0) {
+        if ($timesAmount <= 0) {
             throw new \InvalidArgumentException();
         }

[NoCoverage] Throw_
Money.php:65:13
     public function times(float $timesAmount): Money
     {
         if ($timesAmount < 0) {
-            throw new \InvalidArgumentException();
+            new \InvalidArgumentException();
         }
         return new Money($this->money * $timesAmount, $this->currency);

[Killed] Multiplication
Money.php:67:9
         if ($timesAmount < 0) {
             throw new \InvalidArgumentException();
         }
-        return new Money($this->money * $timesAmount, $this->currency);
+        return new Money($this->money / $timesAmount, $this->currency);
     }
 
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_multiply_euro_by_2
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_multiply_euro_by_2
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
-    'money' => 5.0
+    'money' => 20.0

[Killed] PublicVisibility
Money.php:70:5
         return new Money($this->money * $timesAmount, $this->currency);
     }
 
-    public function add(Money $moneyAdd): Money
+    protected function add(Money $moneyAdd) : Money
     {
         if ($moneyAdd->currency != $this->currency) {
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_add_euro_same_currency
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_add_euro_same_currency
Error: Call to protected method MoneyProblem\Domain\Money::add() from scope Tests\MoneyProblem\Domain\MoneyTest

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:67

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.

[Killed] NotEqual
Money.php:72:9
 
     public function add(Money $moneyAdd): Money
     {
-        if ($moneyAdd->currency != $this->currency) {
+        if ($moneyAdd->currency == $this->currency) {
             throw new \InvalidArgumentException();
         }
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_add_euro_same_currency
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_add_euro_same_currency
InvalidArgumentException: 

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:62
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:67

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.

[Killed] Throw_
Money.php:73:13
     public function add(Money $moneyAdd): Money
     {
         if ($moneyAdd->currency != $this->currency) {
-            throw new \InvalidArgumentException();
+            new \InvalidArgumentException();
         }
         return new Money($this->money + $moneyAdd->money, $this->currency);
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_add_not_same_currency
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_add_not_same_currency
Failed asserting that MoneyProblem\Domain\Money Object (...) is an instance of interface "Throwable".

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/vendor/pitchart/phlunit/src/Checks/CallableCheck.php:60
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:81

FAILURES!

[Killed] Plus
Money.php:75:9
         if ($moneyAdd->currency != $this->currency) {
             throw new \InvalidArgumentException();
         }
-        return new Money($this->money + $moneyAdd->money, $this->currency);
+        return new Money($this->money - $moneyAdd->money, $this->currency);
 
 
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_add_euro_same_currency
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_add_euro_same_currency
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
-    'money' => 0.0
+    'money' => 20.0

[Killed] PublicVisibility
Money.php:80:5
 
     }
 
-    public function divide(float $divideAmount): Money
+    protected function divide(float $divideAmount) : Money
     {
         if ($divideAmount === 0) {
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_divide_same_currency
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_divide_same_currency
Error: Call to protected method MoneyProblem\Domain\Money::divide() from scope Tests\MoneyProblem\Domain\MoneyTest

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:75

ERRORS!
Tests: 3, Assertions: 3, Errors: 1.

[Killed] Identical
Money.php:82:9
 
     public function divide(float $divideAmount): Money
     {
-        if ($divideAmount === 0) {
+        if ($divideAmount !== 0) {
             throw new \InvalidArgumentException();
         }
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_divide_same_currency
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_divide_same_currency
InvalidArgumentException: 

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:69
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/MoneyTest.php:75

ERRORS!
Tests: 3, Assertions: 3, Errors: 1.

[Survived] DecrementInteger
Money.php:82:9
 
     public function divide(float $divideAmount): Money
     {
-        if ($divideAmount === 0) {
+        if ($divideAmount === -1) {
             throw new \InvalidArgumentException();
         }

[NoCoverage] Throw_
Money.php:83:13
     public function divide(float $divideAmount): Money
     {
         if ($divideAmount === 0) {
-            throw new \InvalidArgumentException();
+            new \InvalidArgumentException();
         }
         return new Money($this->money / $divideAmount, $this->currency);

[Killed] Division
Money.php:85:9
         if ($divideAmount === 0) {
             throw new \InvalidArgumentException();
         }
-        return new Money($this->money / $divideAmount, $this->currency);
+        return new Money($this->money * $divideAmount, $this->currency);
 
     }
killedBy: Tests\MoneyProblem\Domain\MoneyTest::test_divide_same_currency
statusReason: 1) Tests\MoneyProblem\Domain\MoneyTest::test_divide_same_currency
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
-    'money' => 20.0
+    'money' => 5.0
