[NoCoverage] PublicVisibility
MoneyCalculator.php:7:5
 
 class MoneyCalculator
 {
-    public static function add(Money  $money1, Money $money2): float
+    protected static function add(Money $money1, Money $money2) : float
     {
         $result = 0;

[NoCoverage] DecrementInteger
MoneyCalculator.php:9:9
 {
     public static function add(Money  $money1, Money $money2): float
     {
-        $result = 0;
+        $result = -1;
         if($money1->currency == $money2->currency){
             $result= new Money($money2->money + $money1->money, $money1->currency);

[NoCoverage] Equal
MoneyCalculator.php:10:9
     public static function add(Money  $money1, Money $money2): float
     {
         $result = 0;
-        if($money1->currency == $money2->currency){
+        if ($money1->currency != $money2->currency) {
             $result= new Money($money2->money + $money1->money, $money1->currency);
 

[NoCoverage] Plus
MoneyCalculator.php:11:13
     {
         $result = 0;
         if($money1->currency == $money2->currency){
-            $result= new Money($money2->money + $money1->money, $money1->currency);
+            $result = new Money($money2->money - $money1->money, $money1->currency);
 
         }
