[Killed] PublicVisibility
Portfolio.php:20:5
     /**
      * @throws MissingExchangeRateException
      */
-    public function evaluate(Currency $toDdevise, Bank $bank): Money
+    protected function evaluate(Currency $toDdevise, Bank $bank) : Money
     {
         return array_reduce($this->money, function (Money $result, Money $money) use ($bank, $toDdevise) {
killedBy: Tests\MoneyProblem\Domain\PortfolioTest::test_evaluate_in_usd
statusReason: 1) Tests\MoneyProblem\Domain\PortfolioTest::test_evaluate_in_usd
Error: Call to protected method MoneyProblem\Domain\Portfolio::evaluate() from scope Tests\MoneyProblem\Domain\PortfolioTest

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/Domain/PortfolioTest.php:28

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] IncrementInteger
Portfolio.php:25:9
         return array_reduce($this->money, function (Money $result, Money $money) use ($bank, $toDdevise) {
             return $result->add($bank->convert($money, $toDdevise));
 
-        }, new Money(0, $toDdevise));
+        }, new Money(1, $toDdevise));
     }
 }
killedBy: Tests\MoneyProblem\Domain\PortfolioTest::test_evaluate_in_usd
statusReason: 1) Tests\MoneyProblem\Domain\PortfolioTest::test_evaluate_in_usd
Failed asserting that two objects are equal.
--- Expected
+++ Actual
@@ @@
 MoneyProblem\Domain\Money Object (
-    'money' => 17.0
+    'money' => 18.0

[Killed] DecrementInteger
Portfolio.php:25:9
         return array_reduce($this->money, function (Money $result, Money $money) use ($bank, $toDdevise) {
             return $result->add($bank->convert($money, $toDdevise));
 
-        }, new Money(0, $toDdevise));
+        }, new Money(-1, $toDdevise));
     }
 }
killedBy: Tests\MoneyProblem\Domain\PortfolioTest::test_evaluate_in_usd
statusReason: 1) Tests\MoneyProblem\Domain\PortfolioTest::test_evaluate_in_usd
InvalidArgumentException: 

/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Money.php:21
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/src/MoneyProblem/Domain/Portfolio.php:20
/home/valentin/Documents/Développement/xtrem-craft-workshop/php/tests/MoneyProblem/Domain/PortfolioTe
