[Killed] BlockStatement
src/Bank.ts:7:88
 export class Bank {
   private readonly _exchangeRates: Map<string, number> = new Map()
 
-  static createBankWithExchangeRate (from: Currency, to: Currency, rate: number): Bank {
-    const bank = new Bank()
-    bank.AddExchangeRate(from, to, rate)
-    return bank
-  }
+  static createBankWithExchangeRate (from: Currency, to: Currency, rate: number): Bank {}
 
   AddExchangeRate (from: Currency, to: Currency, rate: number): void {
killedBy: Bank Should return number when converting from eur to usd
statusReason: TypeError: Cannot read properties of undefined (reading 'Convert')

[Killed] BlockStatement
src/Bank.ts:13:70
     return bank
   }
 
-  AddExchangeRate (from: Currency, to: Currency, rate: number): void {
-    this._exchangeRates.set(this.createKey(from, to), rate)
-  }
+  AddExchangeRate (from: Currency, to: Currency, rate: number): void {}
 
   Convert (amount: number, original: Currency, converted: Currency): number {
killedBy: Bank Should return number when converting from eur to usd
statusReason: Error: EUR-> USD

[Killed] BlockStatement
src/Bank.ts:17:77
     this._exchangeRates.set(this.createKey(from, to), rate)
   }
 
-  Convert (amount: number, original: Currency, converted: Currency): number {
-    if (!this.canConvert(original, converted)) {
-      throw new MissingExchangeRateError(original, converted)
-    }
-
-    return converted === original
-      ? amount
-      : amount * this._exchangeRates.get(this.createKey(original, converted))
-  }
+  Convert (amount: number, original: Currency, converted: Currency): number {}
 
   private canConvert (original: Currency, converted: Currency): boolean {
killedBy: Bank Should return number when converting from eur to usd
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: undefined

[Killed] BooleanLiteral
src/Bank.ts:18:9
   }
 
   Convert (amount: number, original: Currency, converted: Currency): number {
-    if (!this.canConvert(original, converted)) {
+    if (this.canConvert(original, converted)) {
       throw new MissingExchangeRateError(original, converted)
     }
killedBy: Bank Should return number when converting from eur to usd
statusReason: Error: EUR-> USD

[Killed] BlockStatement
src/Bank.ts:18:48
   }
 
   Convert (amount: number, original: Currency, converted: Currency): number {
-    if (!this.canConvert(original, converted)) {
-      throw new MissingExchangeRateError(original, converted)
-    }
+    if (!this.canConvert(original, converted)) {}
 
     return converted === original
killedBy: Bank Should throw error in case of missing exchange rates
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingExchangeRateError

Received function did not throw

[Killed] EqualityOperator
src/Bank.ts:22:12
       throw new MissingExchangeRateError(original, converted)
     }
 
-    return converted === original
+    return converted !== original
       ? amount
       : amount * this._exchangeRates.get(this.createKey(original, converted))
killedBy: Bank Should return number when converting from eur to usd
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Killed] ConditionalExpression
src/Bank.ts:22:12
       throw new MissingExchangeRateError(original, converted)
     }
 
-    return converted === original
+    return false
       ? amount
       : amount * this._exchangeRates.get(this.createKey(original, converted))
killedBy: Bank Should return the same value when converting from usd to usd
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: NaN

[Killed] ArithmeticOperator
src/Bank.ts:24:9
 
     return converted === original
       ? amount
-      : amount * this._exchangeRates.get(this.createKey(original, converted))
+      : amount / this._exchangeRates.get(this.createKey(original, converted))
   }
 
killedBy: Bank Should return number when converting from eur to usd
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 8.333333333333334

[Killed] BlockStatement
src/Bank.ts:27:73
       : amount * this._exchangeRates.get(this.createKey(original, converted))
   }
 
-  private canConvert (original: Currency, converted: Currency): boolean {
-    return (original === converted || this._exchangeRates.has(this.createKey(original, converted)))
-  }
+  private canConvert (original: Currency, converted: Currency): boolean {}
 
   private createKey (original: Currency, converted: Currency): string {
killedBy: Bank Should return number when converting from eur to usd
statusReason: Error: EUR-> USD

[Killed] LogicalOperator
src/Bank.ts:28:13
   }
 
   private canConvert (original: Currency, converted: Currency): boolean {
-    return (original === converted || this._exchangeRates.has(this.createKey(original, converted)))
+    return (original === converted && this._exchangeRates.has(this.createKey(original, converted)))
   }
 
killedBy: Bank Should return number when converting from eur to usd
statusReason: Error: EUR-> USD

[Killed] ConditionalExpression
src/Bank.ts:28:13
   }
 
   private canConvert (original: Currency, converted: Currency): boolean {
-    return (original === converted || this._exchangeRates.has(this.createKey(original, converted)))
+    return (true)
   }
 
killedBy: Bank Should throw error in case of missing exchange rates
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingExchangeRateError

Received function did not throw

[Killed] BlockStatement
src/Bank.ts:31:71
     return (original === converted || this._exchangeRates.has(this.createKey(original, converted)))
   }
 
-  private createKey (original: Currency, converted: Currency): string {
-    return original + '->' + converted
-  }
+  private createKey (original: Currency, converted: Currency): string {}
 }
 
killedBy: Bank Should throw error in case of missing exchange rates
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingExchangeRateError

Received function did not throw

[Survived] StringLiteral
src/Bank.ts:32:23
   }
 
   private createKey (original: Currency, converted: Currency): string {
-    return original + '->' + converted
+    return original + "" + converted
   }
 }
