[Killed] BlockStatement
src/MissingExchangeRateError.ts:4:57
 import { Currency } from './Currency'
 
 export class MissingExchangeRateError extends Error {
-  constructor (original: Currency, converted: Currency) {
-    super(original + '-> ' + converted)
-  }
+  constructor (original: Currency, converted: Currency) {}
 
   message: string
killedBy: Bank Should throw error in case of missing exchange rates
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingExchangeRateError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {
