[Killed] ArrowFunction
src/MoneyCalculator.ts:5:16
 
 // eslint-disable-next-line @typescript-eslint/no-extraneous-class
 export class MoneyCalculator {
-  static Add = (leftMember: number, currency: Currency, rightMember: number): number => leftMember + rightMember
+  static Add = () => undefined
   static Times = (leftMember: number, currency: Currency, rightMember: number): number => leftMember * rightMember
   static Divide = (leftMember: number, currency: Currency, rightMember: number): number => leftMember / rightMember
killedBy: Money add in usd returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: undefined

[Killed] ArithmeticOperator
src/MoneyCalculator.ts:5:89
 
 // eslint-disable-next-line @typescript-eslint/no-extraneous-class
 export class MoneyCalculator {
-  static Add = (leftMember: number, currency: Currency, rightMember: number): number => leftMember + rightMember
+  static Add = (leftMember: number, currency: Currency, rightMember: number): number => leftMember - rightMember
   static Times = (leftMember: number, currency: Currency, rightMember: number): number => leftMember * rightMember
   static Divide = (leftMember: number, currency: Currency, rightMember: number): number => leftMember / rightMember
killedBy: Money add in usd returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: -5

[Killed] ArrowFunction
src/MoneyCalculator.ts:6:18
 // eslint-disable-next-line @typescript-eslint/no-extraneous-class
 export class MoneyCalculator {
   static Add = (leftMember: number, currency: Currency, rightMember: number): number => leftMember + rightMember
-  static Times = (leftMember: number, currency: Currency, rightMember: number): number => leftMember * rightMember
+  static Times = () => undefined
   static Divide = (leftMember: number, currency: Currency, rightMember: number): number => leftMember / rightMember
 }
killedBy: Money multiply in eur returns positive number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] ArithmeticOperator
src/MoneyCalculator.ts:6:91
 // eslint-disable-next-line @typescript-eslint/no-extraneous-class
 export class MoneyCalculator {
   static Add = (leftMember: number, currency: Currency, rightMember: number): number => leftMember + rightMember
-  static Times = (leftMember: number, currency: Currency, rightMember: number): number => leftMember * rightMember
+  static Times = (leftMember: number, currency: Currency, rightMember: number): number => leftMember / rightMember
   static Divide = (leftMember: number, currency: Currency, rightMember: number): number => leftMember / rightMember
 }
killedBy: Money multiply in eur returns positive number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 5

[Killed] ArrowFunction
src/MoneyCalculator.ts:7:19
 export class MoneyCalculator {
   static Add = (leftMember: number, currency: Currency, rightMember: number): number => leftMember + rightMember
   static Times = (leftMember: number, currency: Currency, rightMember: number): number => leftMember * rightMember
-  static Divide = (leftMember: number, currency: Currency, rightMember: number): number => leftMember / rightMember
+  static Divide = () => undefined
 }
 
killedBy: Money divide in korean won returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000.5
Received: undefined

[Killed] ArithmeticOperator
src/MoneyCalculator.ts:7:92
 export class MoneyCalculator {
   static Add = (leftMember: number, currency: Currency, rightMember: number): number => leftMember + rightMember
   static Times = (leftMember: number, currency: Currency, rightMember: number): number => leftMember * rightMember
-  static Divide = (leftMember: number, currency: Currency, rightMember: number): number => leftMember / rightMember
+  static Divide = (leftMember: number, currency: Currency, rightMember: number): number => leftMember * rightMember
 }
 
killedBy: Money divide in korean won returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000.5
Received: 16008
